Delans-TLE/src/Catalogs/ХозяйствующиеСубъектыВЕТИС/ХозяйствующиеСубъектыВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХозяйствующиеСубъектыВЕТИС</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВерсионныхОбъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыХозяйствующихСубъектовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <comment>Внутренние значения полей адреса (контактная информация)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПредставление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.ОрганизацияКонтрагентВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПредприятий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНесопоставленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Предприятия</name>
    <attributes>
      <name>Предприятие</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТорговыйОбъект</name>
      <type>
        <types>DefinedType.ТорговыйОбъектВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроизводственныйОбъект</name>
      <type>
        <types>DefinedType.ПроизводственныйОбъектВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ХозяйствующиеСубъектыВЕТИС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ХозяйствующиеСубъектыВЕТИС.Ссылка КАК Ссылка,
		|	ХозяйствующиеСубъектыВЕТИС.Наименование  КАК Наименование,
		|	ХозяйствующиеСубъектыВЕТИС.Идентификатор КАК Идентификатор
		|ИЗ
		|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
		|ГДЕ
		|	ХозяйствующиеСубъектыВЕТИС.Контрагент = &Контрагент
		|	И ХозяйствующиеСубъектыВЕТИС.Ссылка <> &ТекущийХозяйствующийСубъект";
		
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ТекущийХозяйствующийСубъект", Ссылка);
		
		УстановитьПривилегированныйРежим(Истина);
		Выборка = Запрос.Выполнить().Выбрать();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Выборка.Следующий() Тогда
			
			Если СоответствуетОрганизации Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru='Данная организация уже сопоставлена другому хозяйствующему субъекту с идентификатором %1.'"),
				                           Выборка.Идентификатор);
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru='Данный контрагент уже сопоставлен другому хозяйствующему субъекту (%1).'"),
				                           Выборка.Наименование);
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения ,
			                                                  ЭтотОбъект,
			                                                  "Контрагент",
			                                                  ,
			                                                  Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Предприятия.Количество() > 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	УказанныеПредприятия.ТорговыйОбъект КАК ТорговыйОбъект,
		|	УказанныеПредприятия.ПроизводственныйОбъект КАК ПроизводственныйОбъект,
		|	УказанныеПредприятия.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ УказанныеПредприятия
		|ИЗ
		|	&УказанныеПредприятия КАК УказанныеПредприятия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УказанныеПредприятия.ТорговыйОбъект КАК ТорговыйОбъект,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ТорговыеОбъекты
		|ИЗ
		|	УказанныеПредприятия КАК УказанныеПредприятия
		|
		|СГРУППИРОВАТЬ ПО
		|	УказанныеПредприятия.ТорговыйОбъект
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УказанныеПредприятия.ПроизводственныйОбъект КАК ПроизводственныйОбъект,
		|	СУММА(1) КАК Количество
		|ПОМЕСТИТЬ ПроизводственныеОбъекты
		|ИЗ
		|	УказанныеПредприятия КАК УказанныеПредприятия
		|
		|СГРУППИРОВАТЬ ПО
		|	УказанныеПредприятия.ПроизводственныйОбъект
		|
		|ИМЕЮЩИЕ
		|	СУММА(1) > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТорговыеОбъекты.ТорговыйОбъект КАК Объект,
		|	МИНИМУМ(УказанныеПредприятия.НомерСтроки) КАК НомерСтроки,
		|	ТорговыеОбъекты.Количество КАК Количество,
		|	ИСТИНА КАК ЭтоТорговыйОбъект
		|ИЗ
		|	ТорговыеОбъекты КАК ТорговыеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УказанныеПредприятия КАК УказанныеПредприятия
		|		ПО ТорговыеОбъекты.ТорговыйОбъект = УказанныеПредприятия.ТорговыйОбъект
		|
		|СГРУППИРОВАТЬ ПО
		|	ТорговыеОбъекты.ТорговыйОбъект,
		|	ТорговыеОбъекты.Количество
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПроизводственныеОбъекты.ПроизводственныйОбъект,
		|	МИНИМУМ(УказанныеПредприятия.НомерСтроки),
		|	ПроизводственныеОбъекты.Количество,
		|	ЛОЖЬ
		|ИЗ
		|	ПроизводственныеОбъекты КАК ПроизводственныеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УказанныеПредприятия КАК УказанныеПредприятия
		|		ПО ПроизводственныеОбъекты.ПроизводственныйОбъект = УказанныеПредприятия.ПроизводственныйОбъект
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроизводственныеОбъекты.ПроизводственныйОбъект,
		|	ПроизводственныеОбъекты.Количество";
		
		Запрос.УстановитьПараметр("УказанныеПредприятия", Предприятия.Выгрузить());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Объект) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Выборка.ЭтоТорговыйОбъект Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Торговый объект %1 сопоставлен более чем одному предприятию.'"), Выборка.Объект);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
				                                                  ЭтотОбъект,
				                                                  ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Предприятия", Выборка.НомерСтроки, "ТорговыйОбъект")
				                                                  ,,Отказ);
				
			Иначе
				
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Производственный объект %1 сопоставлен более чем одному предприятию.'"), Выборка.Объект);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, 
				                                                  ЭтотОбъект,
				                                                  ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Предприятия", Выборка.НомерСтроки, "ПроизводственныйОбъект")
				                                                  ,,Отказ);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ИнтеграцияВЕТИС.УстановитьПометкуУдаленияПрисоединенныхФайловХозяйствующегоСубъекта(ЭтотОбъект, Отказ);
	
	КоличествоПредприятий = Предприятия.Количество();
	ЕстьНесопоставленные  = Ложь;
	
	Для Каждого СтрокаПредприятия Из Предприятия Цикл
		
		СтрокаСопоставлена = ЗначениеЗаполнено(СтрокаПредприятия.ТорговыйОбъект);
		
		Если СоответствуетОрганизации Тогда
			СтрокаСопоставлена = СтрокаСопоставлена Или ЗначениеЗаполнено(СтрокаПредприятия.ПроизводственныйОбъект);
		Иначе
			СтрокаПредприятия.ПроизводственныйОбъект = Неопределено;
		КонецЕсли;
		
		ЕстьНесопоставленные = ЕстьНесопоставленные Или НЕ СтрокаСопоставлена;
		
	КонецЦикла;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		РегистрыСведений.ПредприятияЗонОтветственностиВЕТИС.УдалитьПредприятияХозяйствующегоСубъектаИзЗонОтветственности(Ссылка,, Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		РегистрыСведений.ПредприятияЗонОтветственностиВЕТИС.ДобавитьПредприятияВЗоныОтветственностиПоНаследованиюАдреса(Ссылка,, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
